test/fixtures/xml/stamps/cleanse_address_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:tns="http://stamps.com/xml/namespace/2013/10/swsim/swsimv33">
  <soap:Body>
    <tns:CleanseAddress>
      <tns:Authenticator>***authenticator***</tns:Authenticator>
      <tns:Address>
        <tns:FullName>Geoff Anton</tns:FullName>
        <tns:Company>Stamps.com</tns:Company>
        <tns:Address1>12959 Coral Tree Place</tns:Address1>
        <tns:City>Los Angeles</tns:City>
        <tns:State>CA</tns:State>
        <tns:ZIPCode>90066</tns:ZIPCode>
      </tns:Address>
    </tns:CleanseAddress>
  </soap:Body>
</soap:Envelope>
